#### Terraform Plan 📖`success`

<details><summary>Show Plan</summary>

```github_membership.satake: Refreshing state... [id=satake-test:isSatake]
github_team.root-team: Refreshing state... [id=9269919]
github_team_members.root-team-members: Refreshing state... [id=9269919]
github_team.child-team: Refreshing state... [id=9269929]
github_team_members.child-team-members: Refreshing state... [id=9269929]

Terraform used the selected providers to generate the following execution
plan. Resource actions are indicated with the following symbols:
  + create

Terraform will perform the following actions:

  # github_team.grandchild-team will be created
  + resource "github_team" "grandchild-team" {
      + create_default_maintainer = false
      + etag                      = (known after apply)
      + id                        = (known after apply)
      + members_count             = (known after apply)
      + name                      = "grandchild-team"
      + node_id                   = (known after apply)
      + parent_team_id            = "9269929"
      + parent_team_read_id       = (known after apply)
      + parent_team_read_slug     = (known after apply)
      + privacy                   = "closed"
      + slug                      = (known after apply)
    }

Plan: 1 to add, 0 to change, 0 to destroy.

─────────────────────────────────────────────────────────────────────────────

Note: You didn't use the -out option to save this plan, so Terraform can't
guarantee to take exactly these actions if you run "terraform apply" now.
```

</details>